Case1_3DCS49_FineMesh/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{



    walls
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    ".*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    inlet
    {
//        type            cyclic;
        type            zeroGradient;
    }

    outlet
    {
//        type            cyclic;
        type            zeroGradient;
	}


    cylinder
    {
		type calculated;
      //  type            movingWallVelocity;
     //   value           uniform (0 0 0);
    }



}

// ************************************************************************* //
